package com.boray.Data;

public class ChangJinData {
	public static String[] T1(){
		String[] s = new String[36];
		s[0] = "场景0默认";s[1] = "场景1选秀";
		s[2] = "场景2抒情";s[3] = "场景3K歌";
		s[4] = "场景4动感";s[5] = "场景5商务";
		s[6] = "场景6明亮";s[7] = "场景7慢摇";
		s[8] = "场景8柔和";s[9] = "场景9清洁";
		s[10] = "场景10浪漫";s[11] = "场景11关";
		s[12] = "场景12开";s[13] = "场景13开/关";
		s[14] = "场景14吊灯";s[15] = "场景15射灯";
		s[16] = "场景16灯带";s[17] = "场景17筒灯";
		s[18] = "场景18背景灯";s[19] = "场景19茶几灯";
		s[20] = "场景20激光灯";s[21] = "场景21迎宾";
		s[22] = "场景23K";s[23] = "场景24G";
		s[24] = "场景29";s[25] = "场景30";
		s[26] = "场景31";s[27] = "场景32";
		s[28] = "场景33";s[29] = "场景34";
		s[30] = "场景35";s[31] = "场景36";
		s[32] = "场景22控制";s[33] = "场景26渐变";
		s[34] = "场景27摇麦";s[35] = "场景28摇麦";
		return s;
	}
}
